// 1. Дэлгэцийн элементийг барьж авах
const display = document.getElementById("display");

// 2. Дарсан тоо эсвэл үйлдлийг дэлгэцийн төгсгөлд залгаж нэмэх функц
const appendValue = (value) => {
    display.value += value; // += нь өмнөх утга дээр шинэ утгыг залгадаг
};

// 3. Дэлгэцийг бүрэн цэвэрлэх (C товчлуур) функц
const clearDisplay = () =>{
    display.value =""; // Утгыг хоосон текст болгоно
};

// 4. Дэлгэц дээрх бичиглэлийг математик аргаар бодож гаргах (= товчлуур)
const calculateResult = () =>{
    try {
        // eval()-ийг устгаад, орчин үеийн 'Function' объект ашиглаж байна.
        // Энэ нь текстийг шууд код болгож ажиллуулахгүй, зөвхөн математик тооцоолол хийдэг тул аюулгүй.
        display.value = new Function(`return ${display.value}`)();
    } catch (error) {
        // Хэрэв хэрэглэгч "5++2" гэх мэт буруу үйлдэл оруулбал алдаа заана
        display.value ="Алдаа";
    }
    
};